tap "fluxcd/tap", trusted: true
tap "hashicorp/tap", trusted: true
tap "thetillhoff/tap", trusted: true
tap "valkyrie00/bbrew", trusted: true
# Run your GitHub Actions locally
brew "act"
# Simple, modern, secure file encryption
brew "age"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Database toolkit
brew "atlas"
# Nuke a whole AWS account and delete all its resources
brew "aws-nuke"
# Securely manage AWS API credentials using AWS SSO
brew "aws-sso-cli"
# Official Amazon AWS command-line interface
brew "awscli"
# Curl like simplicity to access AWS resources
brew "awscurl"
# Toolchain of the web
brew "biome"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# CLI to install, manage & troubleshoot Kubernetes clusters running Cilium
brew "cilium-cli"
# Cross-platform make
brew "cmake"
# Distributed, open source, package manager for C/C++
brew "conan"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Task is a task runner/build tool that aims to be simpler and easier to use
brew "go-task"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Network, Service & Security Observability for Kubernetes using eBPF
brew "hubble"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Easily check your clusters for use of deprecated APIs
brew "kubent"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# Folder synchronization with OneDrive
brew "onedrive-cli", restart_service: :changed
# Cloud native development platform
brew "pulumi"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Editor of encrypted files
brew "sops"
# Cross-shell prompt for astronauts
brew "starship"
# CLI for out-of-band management of Kubernetes nodes created by Talos
brew "talosctl"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Flux CLI
brew "fluxcd/tap/flux"
# Verifies web things
brew "thetillhoff/tap/webscan"
# Modern TUI for managing Homebrew packages and casks on macOS and Linux
brew "valkyrie00/bbrew/bbrew"
# Terminal-based AI coding assistant
cask "claude-code"
