tap "ariga/tap"
tap "common-fate/granted", trusted: true
tap "ekristen/tap"
tap "fluxcd/tap", trusted: true
tap "go-task/tap", trusted: true
tap "hashicorp/tap", trusted: true
tap "homebrew/cask"
tap "homebrew/core"
tap "siderolabs/tap", trusted: true
tap "thetillhoff/tap", trusted: true
# Run your GitHub Actions locally
brew "act"
# Simple, modern, secure file encryption
brew "age"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Securely manage AWS API credentials using AWS SSO
brew "aws-sso-cli"
# Official Amazon AWS command-line interface
brew "awscli"
# Curl like simplicity to access AWS resources
brew "awscurl"
# Toolchain of the web
brew "biome"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Incredibly fast JavaScript runtime, bundler, test runner, and package manager
brew "bun"
# CLI to install, manage & troubleshoot Kubernetes clusters running Cilium
brew "cilium-cli"
# Cross-platform make
brew "cmake"
# Distributed, open source, package manager for C/C++
brew "conan"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Kubernetes package manager
brew "helm"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Run local Kubernetes cluster in Docker
brew "kind"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Postgres C API library
brew "libpq"
# Command-line interface to LiveKit
brew "livekit-cli"
# Utility for directing compilation
brew "make"
# Open source relational database management system
brew "mysql-client"
# NCurses Disk Usage
brew "ncdu"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu"
# Fast, disk space efficient package manager
brew "pnpm"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Cloud native development platform
brew "pulumi"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Generic machine emulator and virtualizer
brew "qemu"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Powerful, clean, object-oriented scripting language
brew "ruby", link: false
# Safe, concurrent, practical language
brew "rust"
# Editor of encrypted files
brew "sops"
# Generate type safe Go from SQL
brew "sqlc"
# Cross-shell prompt for astronauts
brew "starship"
# User interface to the TELNET protocol
brew "telnet"
# Linter for Terraform files
brew "tflint"
# Clean up files in directories based on their age
brew "tmpreaper"
# Program that allows you to count code, quickly
brew "tokei"
# Find and verify credentials
brew "trufflehog"
# Language for application scale JavaScript development
brew "typescript"
# Disaster recovery for Kubernetes resources and persistent volumes
brew "velero"
# Internet file retriever
brew "wget"
# Network analyzer and capture tool - without graphical user interface
brew "wireshark"
# JavaScript package manager
brew "yarn"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A database toolkit
brew "ariga/tap/atlas", trusted: true
# The easiest way to access your cloud.
brew "common-fate/granted/granted"
# Remove all the resources from an AWS account
brew "ekristen/tap/aws-nuke", trusted: true
# Flux CLI
brew "fluxcd/tap/flux"
# A fast, cross-platform build tool inspired by Make, designed for modern workflows.
brew "go-task/tap/go-task"
# Packer
brew "hashicorp/tap/packer"
# Terraform
brew "hashicorp/tap/terraform"
# CLI for out-of-band management of Kubernetes nodes created by Talos
brew "siderolabs/tap/talosctl"
# Minimal golang templater for websites
brew "thetillhoff/tap/temingo"
# Verifies web things
brew "thetillhoff/tap/webscan"
cask "font-meslo-lg-nerd-font"
# Backup/restore tool
cask "kopiaui"
# Interactive JavaScript, Python or SQL interface
cask "mysql-shell"
# Tool to reverse the direction of scrolling
cask "scroll-reverser"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
