act
age
asdf
atlas
aws-nuke
awscli
cilium-cli
coreutils
fd
flux
gh
git-delta
gnu-sed
gnupg
go
go-task
golangci-lint
granted
helm
iproute2mac
jq
kind
kubectx
libpq
make
mysql-client
ncdu
nmap
nvm
opentofu
packer
pre-commit
pulumi
python@3.11
python@3.12
ripgrep
ruby
rust
sops
sqlc
starship
talosctl
telnet
temingo
terraform
tflint
tmpreaper
tokei
trufflehog
typescript
velero
webscan
wget
yarn
zsh-syntax-highlighting
